// Напишите программу, которая на вход принимает три
// числа и выдаёт максимальное из этих чисел.
//Пример:
// a = 5; b = 7 -> max = 7
// a = 2; b = 10 -> max = 10
// a = -9; b = -3 -> max = -3
Console.WriteLine("Hello, World!");
