// Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// Например:
// 4 -> да
// -3 -> нет
// 7 -> нет
Console.WriteLine("Введи любое число!");
int numbers = Convert.ToInt32(Console.ReadLine());
if (1 == numbers % 2)
{
Console.WriteLine("Число не является чётным!");
}
if (-1 == numbers % 2)
{
Console.WriteLine("Число не является чётным!");
}
if (0 == numbers % 2)
Console.WriteLine("Число является чётным!");

//Ууууррррраааааа!!!
