// Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// Например:
// 4 -> да
// -3 -> нет
// 7 -> нет
Console.WriteLine("Введи любое число!");
int numbers = Convert.ToInt32(Console.ReadLine());
// if (numbers % 2 == 1)
// {
// Console.WriteLine("Число не является чётным!");
// }
// if (numbers % 2 == -1)
// {
// Console.WriteLine("Число не является чётным!");
// }
if (numbers % 2 == 0)
Console.WriteLine("Число является чётным!");
else
{
   Console.WriteLine("Число не является чётным!"); 
}
//Ууууррррраааааа!!!
