// Напишите программу, которая на вход принимает
// одно число (N), а на выход показывает все целые числа в промежутке от -N до N.
// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
// 2 -> "-2, -1, 0, 1, 2"

Console.WriteLine("Ввидите число");
int number = Convert.ToInt32(Console.ReadLine());
while ()